piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/src/MDR32VF0xI_bkp.c
/**
 ******************************************************************************
 * @file    MDR32VF0xI_bkp.c
 * @author  Milandr Application Team
 * @version V0.2.0
 * @date    05/06/2025
 * @brief   This file contains all the BKP firmware functions.
 ******************************************************************************
 * <br><br>
 *
 * THE PRESENT FIRMWARE IS FOR GUIDANCE ONLY. IT AIMS AT PROVIDING CUSTOMERS
 * WITH CODING INFORMATION REGARDING MILANDR'S PRODUCTS IN ORDER TO FACILITATE
 * THE USE AND SAVE TIME. MILANDR SHALL NOT BE HELD LIABLE FOR ANY
 * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES RESULTING
 * FROM THE CONTENT OF SUCH FIRMWARE AND/OR A USE MADE BY CUSTOMERS OF THE
 * CODING INFORMATION CONTAINED HEREIN IN THEIR PRODUCTS.
 *
 * <h2><center>&copy; COPYRIGHT 2025 Milandr</center></h2>
 ******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "MDR32VF0xI_bkp.h"
#include "MDR32VF0xI_utils.h"

/** @addtogroup MDR32VF0xI_StdPeriph_Driver MDR32VF0xI Standard Peripheral Driver
 * @{
 */

/** @addtogroup BKP BKP
 * @{
 */

/** @defgroup BKP_Private_Defines BKP Private Defines
 * @{
 */

#define BKP_RTC_CS_FLAG_MASK (BKP_RTC_CS_OWF |   \
                              BKP_RTC_CS_SECF |  \
                              BKP_RTC_CS_WUTF |  \
                              BKP_RTC_CS_WEC |   \
                              BKP_RTC_CS_ALRAF | \
                              BKP_RTC_CS_ALRBF | \
                              BKP_RTC_CS_TSF)

#define BKP_RTC_CS_FLAG_CLR_MASK (BKP_RTC_CS_OWF |   \
                                  BKP_RTC_CS_SECF |  \
                                  BKP_RTC_CS_WUTF |  \
                                  BKP_RTC_CS_ALRAF | \
                                  BKP_RTC_CS_ALRBF | \
                                  BKP_RTC_CS_TSF)

#define BKP_RTC_CS_IT_MASK (BKP_RTC_CS_OWF_IE |   \
                            BKP_RTC_CS_SECF_IE |  \
                            BKP_RTC_CS_WUTF_IE |  \
                            BKP_RTC_CS_ALRAF_IE | \
                            BKP_RTC_CS_ALRBF_IE)

#define BKP_RTC_TAFCR_FLAG_MASK (BKP_RTC_TAFCR_TAMP_IN_SEL_Msk | \
                                 BKP_RTC_TAFCR_TS_IN_SEL_Msk)

#if defined(USE_MDR32F02_REV_2) || defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
#define BKP_RTC_TAFCR_FLAG_CLR_MASK (BKP_RTC_TAFCR_TAMP_IN_SEL_Msk | \
                                     BKP_RTC_TAFCR_TS_IN_SEL_Msk)
#endif

#define BKP_RTC_TAFCR_IT_MASK (BKP_RTC_TAFCR_TAMP_IE | \
                               BKP_RTC_TAFCR_TS_IE)

#define BKP_RTC_TR_SECONDS_MASK    (BKP_RTC_TR_SU_Msk | BKP_RTC_TR_ST_Msk)
#define BKP_RTC_TR_MINUTES_MASK    (BKP_RTC_TR_MNU_Msk | BKP_RTC_TR_MNT_Msk)
#define BKP_RTC_TR_HOURS_MASK      (BKP_RTC_TR_HU_Msk | BKP_RTC_TR_HT_Msk)

#define BKP_RTC_DR_DATE_MASK       (BKP_RTC_DR_DU_Msk | BKP_RTC_DR_DT_Msk)
#define BKP_RTC_DR_MONTH_MASK      (BKP_RTC_DR_MU_Msk | BKP_RTC_DR_MT_Msk)
#define BKP_RTC_DR_YEAR_MASK       (BKP_RTC_DR_YU_Msk | BKP_RTC_DR_YT_Msk)

#define BKP_RTC_ALARM_SECONDS_MASK (BKP_RTC_ALARMxR_SU_Msk | BKP_RTC_ALARMxR_ST_Msk)
#define BKP_RTC_ALARM_MINUTES_MASK (BKP_RTC_ALARMxR_MNU_Msk | BKP_RTC_ALARMxR_MNT_Msk)
#define BKP_RTC_ALARM_HOURS_MASK   (BKP_RTC_ALARMxR_HU_Msk | BKP_RTC_ALARMxR_HT_Msk)
#define BKP_RTC_ALARM_DATE_MASK    (BKP_RTC_ALARMxR_DU_Msk | BKP_RTC_ALARMxR_DT_Msk)

/** @} */ /* End of the group BKP_Private_Defines */

/** @defgroup BKP_Private_Functions_Declarations BKP Private Functions Declarations
 * @{
 */

static void BKP_RTC_GetDateTimeReg(uint32_t DateRegVal, uint32_t TimeRegVal, BKP_RTC_DateTime_TypeDef* RTC_DateTime);

/** @} */ /* End of the group BKP_Private_Functions_Declarations */

/** @addtogroup BKP_Exported_Functions BKP Exported Functions
 * @{
 */

/** @addtogroup BKP_Common_Control_Functions BKP Common Control Functions
 * @{
 */

/**
 * @brief  Lock/Unlock write access to the BKP registers. The BKP registers are locked by default.
 * @param  LockState: @ref FlagStatus - a new lock state of the BKP registers.
 *         This parameter must be one of the @ref FlagStatus values:
 *             @arg RESET: Unlock the write access;
 *             @arg SET: Lock the write access.
 * @return None.
 */
void BKP_SetRegistersLock(FlagStatus LockState)
{
    /* Check the parameters. */
    assert_param(IS_BIT_STATUS(LockState));

    if (LockState != RESET) {
        /* Lock write access if SET. */
        MDR_BKP->WPR = BKP_WPR_BKP_WPR_LOCK;
    } else {
        /* Unlock write access if RESET. */
        MDR_BKP->WPR = BKP_WPR_BKP_WPR_UNLOCK;
    }
}

/**
 * @brief  Get the current BKP write access lock state. The BKP registers are locked by default.
 * @param  None.
 * @return @ref FlagStatus - write lock state:
 *             @arg RESET: Unlocked;
 *             @arg SET: Locked.
 */
FlagStatus BKP_GetRegistersLock(void)
{
    if (MDR_BKP->WPR == BKP_WPR_BKP_WPR_UNLOCK) {
        /* BKP write access is unlocked. */
        return RESET;
    } else {
        /* BKP write access is locked. */
        return SET;
    }
}

/**
 * @brief  Deinitialize the registers of the BKP subblocks to their default reset values.
 * @note   The following register fields are not reset:
 *             BKP_LDO: FPOR and MODE[1:0] - fields used by the standard boot program;
 *             BKP_LDO: LDO_BOOST[1:0]     - LDO voltage regulator trimming (only for MDR1206FI and MDR1206AFI);
 *             BKP_CLK: HSI_LSI_TRIM[5:0]  - HSI and LSI clock trimming.
 * @note   Before calling BKP_DeInit(BKP_RTC/BKP_ALL), you must wait until the last write to the RTC registers is completed by calling BKP_RTC_WaitForUpdate().
 * @note   When calling BKP_DeInit(BKP_RTC/BKP_ALL), RTC_CLK is switched to LSI. If the previous clock source of RTC_CLK is not LSI, then it must be enabled
 *         to correctly switch the RTC_CLK multiplexer. Also in this case, the cycle counter and core clock from SystemCoreClock are used for delay.
 *         Do not disable the cycle counter. Before calling this function, you must update SystemCoreClock by calling SystemCoreClockUpdate().
 * @param  Subblocks: Specify the BKP subblocks for deinitialization.
 *         This parameter can be any combination of @ref BKP_Subblocks_TypeDef values:
 *             @arg BKP_MEM:     Deinitialize the BKP RAM of cryptographic keys to all zeros;
 *             @arg BKP_CONTROL: Deinitialize the BKP control functions - JTAG and LDO, BLDO voltage regulators (except the LDO trimming for MDR1206FI and MDR1206AFI);
 *             @arg BKP_SW:      Deinitialize the BKP emergency power supply control;
 *             @arg BKP_CLK:     Deinitialize the BKP clock source control (except the HSI and LSI clock trimming);
 *             @arg BKP_RTC:     Deinitialize all RTC registers - RTC, WUT, TAMPER, TIMESTAMP and TMPCAL (TMPCAL only for MDR1206FI and MDR1206AFI);
 *             @arg BKP_ALL:     Deinitialize all BKP subblocks.
 * @return None.
 */
void BKP_DeInit(uint32_t Subblocks)
{
    uint32_t TmpReg, TmpLDO, TmpCLK;
#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
    uint32_t TmpTMPCAL3;
#endif
    BKP_RTC_ClockSource_TypeDef PrevClockSource;

    /* Check the parameters. */
    assert_param(IS_BKP_SUBBLOCK(Subblocks));

    /* Read BKP registers. */
    TmpLDO = MDR_BKP->LDO;
    TmpCLK = MDR_BKP->CLK;
#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
    TmpTMPCAL3 = MDR_BKP->RTC_TMPCAL3;
#endif

    /* Deinitialize the BKP MEM. */
    if ((Subblocks & BKP_MEM) != 0) {
        /* Fast clean BKP MEM if RST_CLK clock is enabled. */
        if ((MDR_RST_CLK->PER2_CLOCK & RST_CLK_PER2_CLOCK_PCLK_EN_RST_CLK) != 0) {
            TmpReg                  = MDR_RST_CLK->PER1_CLOCK;
            MDR_RST_CLK->PER1_CLOCK = TmpReg | RST_CLK_PER1_CLOCK_KEY_RESET_PROG;
            MDR_RST_CLK->PER1_CLOCK = TmpReg;
        } else {
            for (TmpReg = 0; TmpReg < 128; TmpReg++) {
                MDR_BKP->MEM[TmpReg] = 0;
            }
        }
    }

    /* Deinitialize the BKP CONTROL. */
    if ((Subblocks & BKP_CONTROL) != 0) {
#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
        TmpLDO = (TmpLDO & ~(BKP_LDO_BLDO_TRIM_Msk | BKP_LDO_BLDO_BOOST | BKP_LDO_TAMPF | BKP_LDO_SW_OFF)) | BKP_LDO_JTAG_ON;
#else
        TmpLDO = (TmpLDO & ~(BKP_LDO_BLDO_TRIM_Msk | BKP_LDO_BLDO_BOOST | BKP_LDO_TAMPF | BKP_LDO_SW_OFF | BKP_LDO_LDO_BOOST_Msk)) | BKP_LDO_JTAG_ON;
#endif
    }

