piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/src/MDR32VF0xI_bkp.c
    /* Deinitialize the BKP SW. */
    if ((Subblocks & BKP_SW) != 0) {
        TmpLDO = (TmpLDO & ~(BKP_LDO_SW_CNTRL | BKP_LDO_TAMPF)) | BKP_LDO_SW_OFF;
#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
        TmpTMPCAL3 &= ~BKP_RTC_TMPCAL3_SWCTR_INV;
#endif
    }

    /* Deinitialize the BKP CLK. */
    if ((Subblocks & BKP_CLK) != 0) {
        TmpCLK = (TmpCLK & BKP_CLK_HSI_LSI_TRIM_Msk) | BKP_CLK_HSI_ON;
    }

    /* Deinitialize the BKP RTC. */
    if ((Subblocks & BKP_RTC) != 0) {
        PrevClockSource     = (BKP_RTC_ClockSource_TypeDef)(MDR_BKP->RTC_CR & BKP_RTC_CR_RTC_SEL_Msk);
        MDR_BKP->RTC_CR     = BKP_RTC_CR_RTC_RESET;
        MDR_BKP->RTC_PRL    = 0x00007FFB;
        MDR_BKP->RTC_ALRM   = 0;
        MDR_BKP->RTC_CS     = BKP_RTC_CS_FLAG_CLR_MASK;
        MDR_BKP->RTC_ALRMAR = 0;
        MDR_BKP->RTC_ALRMBR = 0;
        MDR_BKP->RTC_TAFCR  = 0;
        MDR_BKP->RTC_CR     = 0;
#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
        MDR_BKP->RTC_TMPCAL1 = 0x10C852DA;
        MDR_BKP->RTC_TMPCAL2 = 0xE6208001;
        TmpTMPCAL3           = (TmpTMPCAL3 & BKP_RTC_TMPCAL3_SWCTR_INV) | 0x00B52000;
#endif
        /* Wait for the RTC_CLK multiplexer to switch. */
        if (PrevClockSource != BKP_RTC_CLK_SRC_LSI) {
            BKP_RTC_WaitClkSwitch(PrevClockSource);
        }
    }

    /* Write BKP registers. */
    if ((Subblocks & (BKP_CONTROL | BKP_SW)) != 0) {
        MDR_BKP->LDO = TmpLDO;
    }
    if ((Subblocks & (BKP_CLK | BKP_RTC)) != 0) {
        MDR_BKP->CLK = TmpCLK;
    }
#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
    if ((Subblocks & (BKP_SW | BKP_RTC)) != 0) {
        MDR_BKP->RTC_TMPCAL3 = TmpTMPCAL3;
    }
#endif
}

/** @} */ /* End of the group BKP_Common_Control_Functions */

/** @addtogroup BKP_Control_Functions BKP Control Functions
 * @{
 */

/**
 * @brief  Enable or disable the JTAG interface.
 * @param  NewState: @ref FunctionalState - a new state of the JTAG interface.
 * @return None.
 */
void BKP_JTAG_Cmd(FunctionalState NewState)
{
    uint32_t TmpReg;

    /* Check the parameters. */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    TmpReg = MDR_BKP->LDO & ~(BKP_LDO_SW_OFF | BKP_LDO_TAMPF | BKP_LDO_JTAG_ON);
    if (NewState != DISABLE) {
        TmpReg |= BKP_LDO_JTAG_ON;
    }
    MDR_BKP->LDO = TmpReg;
}

/**
 * @brief  Get the JTAG interface work state.
 * @param  None.
 * @return @ref FunctionalState - the current work state of the JTAG interface.
 */
FunctionalState BKP_JTAG_GetCmdState(void)
{
    FunctionalState State;

    if ((MDR_BKP->LDO & BKP_LDO_JTAG_ON) == 0) {
        State = DISABLE;
    } else {
        State = ENABLE;
    }

    return State;
}

/**
 * @brief  Get WAKEUPx input state.
 * @param  Wakeup: @ref BKP_WAKEUP_TypeDef - specify a WAKEUPx input.
 * @return @ref FlagStatus - the current WAKEUPx input state.
 */
FlagStatus BKP_GetWAKEUPStatus(BKP_WAKEUP_TypeDef Wakeup)
{
    /* Check the parameters. */
    assert_param(IS_BKP_WAKEUP(Wakeup));

    if ((MDR_BKP->LDO & (uint32_t)Wakeup) != 0) {
        return SET;
    } else {
        return RESET;
    }
}

/**
 * @brief  Set the internal voltage regulator trimming.
 * @param  LDO_Boost: Trimming value of the internal voltage regulator.
 *         This parameter is a value from 0x0 to 0x3, where 0x0 is a typical value.
 * @return None.
 */
void BKP_LDO_SetBoostTrim(uint8_t LDO_Boost)
{
    uint32_t TmpReg;

    /* Check the parameters. */
    assert_param(IS_BKP_LDO_BOOST(LDO_Boost));

    TmpReg = MDR_BKP->LDO & ~(BKP_LDO_SW_OFF | BKP_LDO_TAMPF);
    TmpReg &= ~(BKP_LDO_LDO_BOOST_Msk);
    TmpReg |= (uint32_t)LDO_Boost << BKP_LDO_LDO_BOOST_Pos;
    MDR_BKP->LDO = TmpReg;
}

/**
 * @brief  Get the internal voltage regulator trimming.
 * @param  None.
 * @return Trimming value of the internal voltage regulator.
 */
uint8_t BKP_LDO_GetBoostTrim(void)
{
    return (uint8_t)((MDR_BKP->LDO & BKP_LDO_LDO_BOOST_Msk) >> BKP_LDO_LDO_BOOST_Pos);
}

/**
 * @brief  Set the internal BKP voltage regulator trimming.
 * @param  BLDO_Boost: @ref BKP_BLDO_Boost_TypeDef - trimming value of the internal BKP voltage regulator.
 * @return None.
 */
void BKP_BLDO_SetBoostTrim(BKP_BLDO_Boost_TypeDef BLDO_Boost)
{
    uint32_t TmpReg;

    /* Check the parameters. */
    assert_param(IS_BKP_BLDO_BOOST(BLDO_Boost));

    TmpReg = MDR_BKP->LDO & ~(BKP_LDO_SW_OFF | BKP_LDO_TAMPF);
    TmpReg &= ~(BKP_LDO_BLDO_BOOST | BKP_LDO_BLDO_TRIM_Msk);
    TmpReg |= (uint32_t)BLDO_Boost;
    MDR_BKP->LDO = TmpReg;
}

/**
 * @brief  Get the internal BKP voltage regulator trimming.
 * @param  None.
 * @return @ref BKP_BLDO_Boost_TypeDef - trimming value of the internal BKP voltage regulator.
 */
BKP_BLDO_Boost_TypeDef BKP_BLDO_GetBoostTrim(void)
{
    return (BKP_BLDO_Boost_TypeDef)(MDR_BKP->LDO & (BKP_LDO_BLDO_BOOST | BKP_LDO_BLDO_TRIM_Msk));
}

/** @} */ /* End of the group BKP_Control_Functions */

/** @addtogroup BKP_Software_Functions BKP Software Functions
 * @{
 */

/**
 * @brief  Set the power on reset flag (FPOR).
 * @param  PORFlag: @ref FlagStatus - a new state of the FPOR flag.
 * @return None.
 */
void BKP_SetFlagPOR(FlagStatus PORFlag)
{
    uint32_t TmpReg;

    /* Check the parameters. */
    assert_param(IS_BIT_STATUS(PORFlag));

    TmpReg = MDR_BKP->LDO & ~(BKP_LDO_SW_OFF | BKP_LDO_TAMPF | BKP_LDO_FPOR);
    if (PORFlag != RESET) {
        TmpReg |= BKP_LDO_FPOR;
    }
    MDR_BKP->LDO = TmpReg;
}

/**
 * @brief  Get the power on reset flag (FPOR).
 * @param  None.
 * @return @ref FlagStatus - the current state of FPOR (SET or RESET).
 */
FlagStatus BKP_GetFlagPOR(void)
{
    FlagStatus Status;

    if ((MDR_BKP->LDO & BKP_LDO_FPOR) != 0) {
        Status = SET;
    } else {
        Status = RESET;
    }

    return Status;
}

/**
 * @brief  Set the MCU boot mode (if used in bootloader).
 * @param  Mode: MCU boot mode.
 *         This parameter can be a value from 0x0 to 0x3.
 * @return None.
 */
void BKP_SetMODE(uint8_t Mode)
{
    uint32_t TmpReg;

    /* Check the parameters. */
    assert_param(IS_BKP_MODE(Mode));

    TmpReg = MDR_BKP->LDO & ~(BKP_LDO_SW_OFF | BKP_LDO_TAMPF | BKP_LDO_MODE_Msk);
    TmpReg |= (uint32_t)Mode << BKP_LDO_MODE_Pos;
    MDR_BKP->LDO = TmpReg;
}

/**
 * @brief  Get the MCU boot mode (if used in bootloader).
 * @param  None.
 * @return MCU boot mode (if used in bootloader).
 */
uint8_t BKP_GetMODE(void)
{
    return (uint8_t)((MDR_BKP->LDO & BKP_LDO_MODE_Msk) >> BKP_LDO_MODE_Pos);
}

/** @} */ /* End of the group BKP_Software_Functions */

