piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/src/MDR32VF0xI_bkp.c
/** @addtogroup BKP_Emergency_Power_Supply_Control_Functions BKP Emergency Power Supply Control Functions
 * @{
 */

/**
 * @brief  Enable or disable the emergency power supply control using battery.
 * @param  NewState: @ref FunctionalState - a new state of the emergency power supply control.
 * @return None.
 */
void BKP_SW_Cmd(FunctionalState NewState)
{
    uint32_t TmpReg;

    /* Check the parameters. */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    TmpReg = MDR_BKP->LDO & ~(BKP_LDO_SW_OFF | BKP_LDO_TAMPF | BKP_LDO_SW_CNTRL);
    if (NewState != DISABLE) {
        TmpReg |= BKP_LDO_SW_CNTRL;
    }
    MDR_BKP->LDO = TmpReg;
}

/**
 * @brief  Get the emergency power supply control state.
 * @param  None.
 * @return @ref FunctionalState - the current state of the emergency power supply control.
 */
FunctionalState BKP_SW_GetCmdState(void)
{
    return (FunctionalState)((MDR_BKP->LDO & BKP_LDO_SW_CNTRL) >> BKP_LDO_SW_CNTRL_Pos);
}

/**
 * @brief  Disable the emergency power supply (clear SW_PWR to 0).
 * @param  None.
 * @return None.
 */
void BKP_SW_DisablePower(void)
{
    MDR_BKP->LDO = (MDR_BKP->LDO & ~BKP_LDO_TAMPF) | BKP_LDO_SW_OFF;
}

/**
 * @brief  Get the emergency power supply status (SW_PWR status) when SW_CNTRL = 1.
 * @param  None.
 * @return @ref FlagStatus - the current state of the emergency power supply status.
 *         This parameter can be one of the @ref FlagStatus enum values:
 *             @arg SET:   The emergency power supply is switched on (SW_PWR = 1).
 *             @arg RESET: The emergency power supply is switched off (SW_PWR = 0).
 */
FlagStatus BKP_SW_GetPowerStatus(void)
{
    FlagStatus Status;

    if ((MDR_BKP->LDO & BKP_LDO_SW_OFF) != 0) {
        Status = SET;
    } else {
        Status = RESET;
    }

    return Status;
}

#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
/**
 * @brief  Configure the BKP SW output inversion.
 * @param  Polarity: @ref BKP_SW_Polarity_TypeDef - enable or disable inversion of the BKP SW output.
 * @return None.
 */
void BKP_SW_SetPolarity(BKP_SW_Polarity_TypeDef Polarity)
{
    uint32_t TmpReg;

    /* Check the parameters. */
    assert_param(IS_BKP_SW_POLARITY(Polarity));

    TmpReg = MDR_BKP->RTC_TMPCAL3 & ~BKP_RTC_TMPCAL3_SWCTR_INV;
    TmpReg |= (uint32_t)Polarity;
    MDR_BKP->RTC_TMPCAL3 = TmpReg;
}

/**
 * @brief  Get the BKP SW output inversion state.
 * @param  None.
 * @return @ref BKP_SW_Polarity_TypeDef - the BKP SW output inversion state.
 */
BKP_SW_Polarity_TypeDef BKP_SW_GetPolarity(void)
{
    return (BKP_SW_Polarity_TypeDef)(MDR_BKP->RTC_TMPCAL3 & BKP_RTC_TMPCAL3_SWCTR_INV);
}
#endif

/** @} */ /* End of the group BKP_Emergency_Power_Supply_Control_Functions */

/** @addtogroup BKP_Clock_Source_Control_Functions BKP Clock Source Control Functions
 * @{
 */

/**
 * @brief  HSI (High Speed Internal) clock mode selection.
 * @param  NewState: @ref FunctionalState - the mode selector (switch off (DISABLE) or on (ENABLE)).
 * @return None.
 */
void BKP_HSI_Cmd(FunctionalState NewState)
{
    /* Check the parameters. */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState != DISABLE) {
        MDR_BKP->CLK |= BKP_CLK_HSI_ON;
    } else {
        MDR_BKP->CLK &= ~BKP_CLK_HSI_ON;
    }
}

/**
 * @brief  Get the HSI clock mode selection.
 * @param  None.
 * @return @ref FunctionalState - the current mode selector state of the HSI clock.
 */
FunctionalState BKP_HSI_GetCmdState(void)
{
    FunctionalState State;

    if ((MDR_BKP->CLK & BKP_CLK_HSI_ON) == 0) {
        State = DISABLE;
    } else {
        State = ENABLE;
    }

    return State;
}

/**
 * @brief  Set the HSI and LSI clock trimming.
 * @param  TrimValue: HSI and LSI frequencies trim value.
 *         This parameter must be a number from 0x00 to 0x3F.
 * @return None.
 */
void BKP_HSI_LSI_SetTrim(uint8_t TrimValue)
{
    uint32_t TmpReg;

    /* Check the parameters. */
    assert_param(IS_BKP_HSI_LSI_TRIM_VALUE(TrimValue));

    TmpReg = MDR_BKP->CLK & ~BKP_CLK_HSI_LSI_TRIM_Msk;
    TmpReg |= (uint32_t)TrimValue << BKP_CLK_HSI_LSI_TRIM_Pos;
    MDR_BKP->CLK = TmpReg;
}

/**
 * @brief  Get the HSI and LSI clock trimming.
 * @param  None.
 * @return HSI and LSI frequencies trim value.
 */
uint8_t BKP_HSI_LSI_GetTrim(void)
{
    return (uint8_t)((MDR_BKP->CLK & BKP_CLK_HSI_LSI_TRIM_Msk) >> BKP_CLK_HSI_LSI_TRIM_Pos);
}

/**
 * @brief  HSI clock status.
 * @note   The cycle counter and core clock from SystemCoreClock are used for delay. Do not disable the cycle counter.
 *         Before calling this function, you must update SystemCoreClock by calling SystemCoreClockUpdate().
 * @param  None.
 * @return @ref ErrorStatus - SUCCESS if HSI clock is ready, else ERROR.
 */
ErrorStatus BKP_HSI_GetStatus(void)
{
    ErrorStatus State;
    FlagStatus  Flag;
    uint32_t    Ticks;

    /* Calculates the number of ticks according to the current clock frequency */
    Ticks = (SystemCoreClock * HSIRDY_TIMEOUT_TICK) / HSI_CLK_FREQUENCY_TYP_Hz;

    /* Wait until HSI time out has occurred. */
    DELAY_CycleCounter_WaitTicksAsm(Ticks);

    Flag = BKP_CLK_GetFlagStatus(BKP_FLAG_HSIRDY);

    if (Flag != RESET) {
        State = SUCCESS;
    } else {
        State = ERROR;
    }

    return State;
}

/**
 * @brief  LSI (Low Speed Internal) clock mode selection.
 * @param  NewState: @ref FunctionalState - the mode selector (switch off (DISABLE) or on (ENABLE)).
 * @return None.
 */
void BKP_LSI_Cmd(FunctionalState NewState)
{
    /* Check the parameters. */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState != DISABLE) {
        MDR_BKP->CLK |= BKP_CLK_LSI_ON;
    } else {
        MDR_BKP->CLK &= ~BKP_CLK_LSI_ON;
    }
}

/**
 * @brief  Get the LSI clock mode selection.
 * @param  None.
 * @return @ref FunctionalState - the current mode selector state of the LSI clock.
 */
FunctionalState BKP_LSI_GetCmdState(void)
{
    FunctionalState State;

    if ((MDR_BKP->CLK & BKP_CLK_LSI_ON) == 0) {
        State = DISABLE;
    } else {
        State = ENABLE;
    }

