piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/src/MDR32VF0xI_bkp.c
    return State;
}

/**
 * @brief  LSI clock status.
 * @note   The cycle counter and core clock from SystemCoreClock are used for delay. Do not disable the cycle counter.
 *         Before calling this function, you must update SystemCoreClock by calling SystemCoreClockUpdate().
 * @param  None.
 * @return @ref ErrorStatus - SUCCESS if LSI clock is ready, else ERROR.
 */
ErrorStatus BKP_LSI_GetStatus(void)
{
    ErrorStatus State;
    FlagStatus  Flag;
    uint32_t    Ticks;

    /* Calculates the number of ticks according to the current clock frequency */
    Ticks = (SystemCoreClock * LSIRDY_TIMEOUT_TICK) / LSI_FREQUENCY_Hz;

    /* Wait until LSI time out has occurred. */
    DELAY_CycleCounter_WaitTicksAsm(Ticks);

    Flag = BKP_CLK_GetFlagStatus(BKP_FLAG_LSIRDY);

    if (Flag != RESET) {
        State = SUCCESS;
    } else {
        State = ERROR;
    }

    return State;
}

/**
 * @brief  LSE (Low Speed External) clock mode and source selection based on @ref LSE_EXT_GEN_MODE definition.
 * @param  NewState: @ref FunctionalState - a new state of the LSE clock.
 * @return None.
 */
void BKP_LSE_Cmd(FunctionalState NewState)
{
    uint32_t TmpReg;

    /* Check the parameters. */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

#if !defined(LSE_EXT_GEN_MODE)
    TmpReg = MDR_BKP->CLK & ~(BKP_CLK_LSE_BYP | BKP_CLK_LSE_ON);
    if (NewState == DISABLE) {
        MDR_BKP->CLK = TmpReg;
    } else {
        MDR_BKP->CLK = TmpReg | BKP_CLK_LSE_ON;
    }
#else
    TmpReg = MDR_BKP->CLK | (BKP_CLK_LSE_BYP | BKP_CLK_LSE_ON);
    if (NewState == DISABLE) {
        MDR_BKP->CLK = TmpReg & ~BKP_CLK_LSE_ON;
    } else {
        MDR_BKP->CLK = TmpReg;
    }
#endif
}

/**
 * @brief  LSE (Low Speed External) clock mode and source selection.
 * @param  LSEMode: @ref BKP_LSE_Mode_TypeDef - the mode selector.
 * @return None.
 */
void BKP_LSE_Config(BKP_LSE_Mode_TypeDef LSEMode)
{
    /* Check the parameters. */
    assert_param(IS_BKP_LSE_MODE(LSEMode));

    MDR_BKP->CLK &= ~(BKP_CLK_LSE_ON | BKP_CLK_LSE_BYP);
    MDR_BKP->CLK |= (uint32_t)LSEMode;
}

/**
 * @brief  Get the LSE clock mode and source selection.
 * @param  None.
 * @return @ref BKP_LSE_Mode_TypeDef - current LSE mode mode and source selection.
 */
BKP_LSE_Mode_TypeDef BKP_LSE_GetModeConfig(void)
{
    return (BKP_LSE_Mode_TypeDef)(MDR_BKP->CLK & (BKP_CLK_LSE_ON | BKP_CLK_LSE_BYP));
}

/**
 * @brief  Get LSE clock status.
 * @note   The cycle counter and core clock from SystemCoreClock are used for delay. Do not disable the cycle counter.
 *         Before calling this function, you must update SystemCoreClock by calling SystemCoreClockUpdate().
 *         If the LSERDY_USER_TIMEOUT_MS definition is active, the start time for MDR1206 is calculated based on the resonator characteristics.
 * @param  None.
 * @return @ref ErrorStatus - SUCCESS if LSE clock is ready, else ERROR.
 */
ErrorStatus BKP_LSE_GetStatus(void)
{
    uint32_t    DelayConst;
    ErrorStatus State;
    FlagStatus  Flag;

    DelayConst = DELAY_CYCLE_COUNTER_GET_CONST_US(SystemCoreClock);

    /* Wait until LSE time out has occurred. */
#if defined(LSERDY_USER_TIMEOUT_MS)

/** Pi - Pi (to the tenth digit) for calculating startup time LSE. */
#define Pi (3.1415926535f)
/** Omega - cyclic frequency. */
#define Omega (2 * Pi * QUARTZ_FREQUENCY_LSE_Hz)
/** K - proportionality coefficient. Gm - transconductance of the amplifying transistor (A/V).
 * Internal microcontroller characteristics for the LSE generator.
 * Specified in the documentation and differs for CHIP_ID = 215 and CHIP_ID = 217. */
#define K_MDR1206AFI  35
#define K_MDR1206FI   12
#define Gm_MDR1206AFI (152e-6f)
#define Gm_MDR1206FI  (694e-6f)
/** Auxiliary components in calculating the start time. */
#define Comp                         (C_LOAD_LSE * C_LOAD_LSE + C_SHUNT_LSE * C_LOAD_LSE)
#define Slave_Numerator_MDR1206AFI   (4 * Gm_MDR1206AFI * C_LOAD_LSE * C_LOAD_LSE)
#define Slave_Numerator_MDR1206FI    (4 * Gm_MDR1206FI * C_LOAD_LSE * C_LOAD_LSE)
#define Slave_Denominator_MDR1206AFI ((Gm_MDR1206AFI * C_SHUNT_LSE * Gm_MDR1206AFI * C_SHUNT_LSE) + (16 * Omega * Omega * Comp * Comp))
#define Slave_Denominator_MDR1206FI  ((Gm_MDR1206FI * C_SHUNT_LSE * Gm_MDR1206FI * C_SHUNT_LSE) + (16 * Omega * Omega * Comp * Comp))

    volatile float Fraction, Main_Denominator, T_Start;

    /* Main startup time calculation */
    if (GetChipID() == CHIP_ID_MDR1206AFI) {
        Fraction         = Slave_Numerator_MDR1206AFI / Slave_Denominator_MDR1206AFI;
        Main_Denominator = Omega * (Fraction - RM_LSE);
        T_Start          = K_MDR1206AFI * ((QUALITY_FACTOR_LSE * RM_LSE) / Main_Denominator);
    } else {
        Fraction         = Slave_Numerator_MDR1206FI / Slave_Denominator_MDR1206FI;
        Main_Denominator = Omega * (Fraction - RM_LSE);
        T_Start          = K_MDR1206FI * ((QUALITY_FACTOR_LSE * RM_LSE) / Main_Denominator);
    }
    /* Convert seconds to milliseconds */
    T_Start *= 1000;

    DELAY_CycleCounter_WaitTicksAsm(DELAY_GET_TICKS_MS(((uint32_t)T_Start), DelayConst));
#else
    DELAY_CycleCounter_WaitTicksAsm(DELAY_GET_TICKS_MS(LSERDY_TIMEOUT_MS, DelayConst));
#endif

    Flag = BKP_CLK_GetFlagStatus(BKP_FLAG_LSERDY);

    if (Flag != RESET) {
        State = SUCCESS;
    } else {
        State = ERROR;
    }

    return State;
}

/**
 * @brief  LSE (Low Speed External) clock operation configuration.
 * @param  LSEConf: LSE working mode configuration.
 * @note   Default value is 0x0. In case of problems with startup with
 *         the default value of the LSEConf configuration[1:0] = 00,
 *         the generator should be started with other three configurations - 0x1, 0x2 or 0x3.
 *         Other configurations are less sensitive to the interference,
 *         but have a higher current consumption.
 * @return None.
 */
void BKP_LSE_SetWorkConfig(uint8_t LSEConf)
{
    uint32_t TmpReg;

    /* Check the parameters. */
    assert_param(IS_BKP_LSE_CONF(LSEConf));

    TmpReg = MDR_BKP->CLK & ~BKP_CLK_LSE_CONF_Msk;
    TmpReg |= (uint32_t)LSEConf << BKP_CLK_LSE_CONF_Pos;
    MDR_BKP->CLK = TmpReg;
}

/**
 * @brief  Check whether a specified BKP CLK ready flag is set or not.
 * @param  Flag: @ref BKP_CLK_Flags_TypeDef - specify the clock generator ready flag to check.
 * @return @ref FlagStatus - a state of BKP CLK ready flag (SET or RESET).
 */
FlagStatus BKP_CLK_GetFlagStatus(BKP_CLK_Flags_TypeDef Flag)
{
    FlagStatus Status;

    /* Check the parameters. */
    assert_param(IS_BKP_CLK_FLAG(Flag));

    if ((MDR_BKP->CLK & (uint32_t)Flag) != 0) {
        Status = SET;
    } else {
        Status = RESET;
    }

