piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/src/MDR32VF0xI_bkp.c
    return Status;
}
/** @} */ /* End of the group BKP_Clock_Source_Control_Functions */

/** @addtogroup BKP_RTC_Control_Functions BKP RTC Control Functions
 * @{
 */

/**
  * @brief  Enable or disable the RTC reset.
            The RTC registers are set to their default reset values on reset.
  * @param  NewState: @ref FunctionalState - a new state of the RTC reset.
  * @return None.
  */
void BKP_RTC_Reset(FunctionalState NewState)
{
    /* Check the parameters. */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState != DISABLE) {
        MDR_BKP->RTC_CR |= BKP_RTC_CR_RTC_RESET;
    } else {
        MDR_BKP->RTC_CR &= ~BKP_RTC_CR_RTC_RESET;
    }
}

/**
 * @brief  Enable or disable the RTC.
 * @param  NewState: @ref FunctionalState - a new state of the RTC.
 * @return None.
 */
void BKP_RTC_Cmd(FunctionalState NewState)
{
    /* Check the parameters. */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState != DISABLE) {
        MDR_BKP->RTC_CR |= BKP_RTC_CR_RTC_EN;
    } else {
        MDR_BKP->RTC_CR &= ~BKP_RTC_CR_RTC_EN;
    }
}

/**
 * @brief  Get the RTC work state.
 * @param  None.
 * @return @ref FunctionalState - the current work state of the RTC.
 */
FunctionalState BKP_RTC_GetCmdState(void)
{
    FunctionalState State;

    if ((MDR_BKP->RTC_CR & BKP_RTC_CR_RTC_EN) == 0) {
        State = DISABLE;
    } else {
        State = ENABLE;
    }

    return State;
}

/**
 * @brief  Wait until the last write operation on RTC registers has finished.
 * @note   This function must be called before any write to the following RTC registers:
 *         RTC_WUTR, RTC_PREDIV_S, RTC_TR, RTC_DR.
 * @param  None.
 * @return None.
 */
void BKP_RTC_WaitForUpdate(void)
{
    /* Loop while WEC flag is not reset. */
    while ((MDR_BKP->RTC_CS & BKP_RTC_CS_WEC) != 0) { }
}

/**
 * @brief  Configure the RTC clock source.
 * @note   Switching the RTC_CLK frequency requires both frequency sources to be enabled.
 *         Exception: first switch from a disabled LSI to another source after a power reset.
 *         In this case, enabling the LSI frequency is not necessary.
 * @note   To wait for a valid RTC_CLK frequency after switching use BKP_RTC_WaitClkSwitch().
 * @param  ClockSource: @ref BKP_RTC_ClockSource_TypeDef - specify the RTC clock source.
 * @return None.
 */
void BKP_RTC_SetClkSource(BKP_RTC_ClockSource_TypeDef ClockSource)
{
    uint32_t TmpReg;

    /* Check the parameters. */
    assert_param(IS_BKP_RTC_CLOCK_SOURCE(ClockSource));

    TmpReg = MDR_BKP->RTC_CR & ~BKP_RTC_CR_RTC_SEL_Msk;
    TmpReg |= (uint32_t)ClockSource;
    MDR_BKP->RTC_CR = TmpReg;
}

/**
 * @brief  Get the RTC clock source.
 * @param  None.
 * @return @ref BKP_RTC_ClockSource_TypeDef - the RTC clock source.
 */
BKP_RTC_ClockSource_TypeDef BKP_RTC_GetClkSource(void)
{
    return (BKP_RTC_ClockSource_TypeDef)(MDR_BKP->RTC_CR & BKP_RTC_CR_RTC_SEL_Msk);
}

/**
 * @brief  Wait for the RTC_CLK multiplexer to switch for the selected clock source (3 periods of the frequency).
 * @note   A valid RTC_CLK is formed after 3 periods of the frequency from which switching occurs (1st call BKP_RTC_WaitClkSwitch()),
 *         plus 3 periods of the frequency to which switching occurs (2nd call BKP_RTC_WaitClkSwitch()).
 *         Exception: first switch from a disabled LSI to another source after a power reset. In this case,
 *         a valid RTC_CLK is formed after 3 periods of the frequency to which the switching occurs.
 * @note   The cycle counter and core clock from SystemCoreClock are used for delay. Do not disable the cycle counter.
 *         Before calling this function, you must update SystemCoreClock by calling SystemCoreClockUpdate().
 * @param  ClockSource: @ref BKP_RTC_ClockSource_TypeDef - specify the RTC clock source.
 * @return None.
 */
void BKP_RTC_WaitClkSwitch(BKP_RTC_ClockSource_TypeDef ClockSource)
{
    uint32_t RTC_Freq, Ticks, TmpReg;

    /* Check the parameters. */
    assert_param(IS_BKP_RTC_CLOCK_SOURCE(ClockSource));

    switch (ClockSource) {
        case BKP_RTC_CLK_SRC_LSI:
            RTC_Freq = LSI_FREQUENCY_Hz;
            break;
        case BKP_RTC_CLK_SRC_LSE:
            RTC_Freq = LSE_FREQUENCY_Hz;
            break;
        case BKP_RTC_CLK_SRC_HSI_RTC:
            TmpReg = MDR_RST_CLK->RTC_CLOCK >> RST_CLK_RTC_CLOCK_HSI_SEL_Pos;
            if ((TmpReg & ((uint32_t)0x8)) == 0) {
                RTC_Freq = HSI_FREQUENCY_Hz;
            } else {
                RTC_Freq = HSI_FREQUENCY_Hz >> ((TmpReg & ((uint32_t)0x7)) + 1);
            }
            break;
        case BKP_RTC_CLK_SRC_HSE_RTC:
            TmpReg = MDR_RST_CLK->RTC_CLOCK;
            if ((TmpReg & ((uint32_t)0x8)) == 0) {
                RTC_Freq = HSE_FREQUENCY_Hz;
            } else {
                RTC_Freq = HSE_FREQUENCY_Hz >> ((TmpReg & ((uint32_t)0x7)) + 1);
            }
            break;
        default:
            RTC_Freq = 0;
            break;
    }

    if (RTC_Freq != 0) {
        /* Calculates the number of ticks according to the current clock frequency. */
        Ticks = (SystemCoreClock * BKP_RTC_CLK_MUX_SWITCH_TICK) / RTC_Freq;

        /* Wait for the RTC_CLK multiplexer to switch. */
        DELAY_CycleCounter_WaitTicksAsm(Ticks);
    }
}

/**
 * @brief  Configure the RTC_CLK clock calibration value.
 * @note   After writing, the internal register is updated after 2 clock cycles of the RTC_CLK frequency.
 * @param  Calibration: specify the number of RTC_CLK clocks out of 2^20 to be discarded.
 *         This parameter can be a number from 0x00 to 0xFF.
 * @return None.
 */
void BKP_RTC_SetClkCalibration(uint8_t Calibration)
{
    uint32_t TmpReg;

    TmpReg = MDR_BKP->RTC_CR & ~BKP_RTC_CR_RTC_CAL_Msk;
    TmpReg |= (uint32_t)Calibration << BKP_RTC_CR_RTC_CAL_Pos;
    MDR_BKP->RTC_CR = TmpReg;
}

/**
 * @brief  Get the RTC_CLK clock calibration value.
 * @param  None.
 * @return RTC_CLK clock calibration value.
 */
uint8_t BKP_RTC_GetClkCalibration(void)
{
    return (uint8_t)((MDR_BKP->RTC_CR & BKP_RTC_CR_RTC_CAL_Msk) >> BKP_RTC_CR_RTC_CAL_Pos);
}

/**
 * @brief  Set the RTC_CLK prescaler counter value.
 * @note   Before calling this function, you must wait until the last write to the RTC registers is completed by calling BKP_RTC_WaitForUpdate().
 * @param  PrescalerCounterValue: a new value of the RTC_CLK prescaler counter.
 *         This parameter can be a number from 0x00000000 to 0x000FFFFF.
 * @return None.
 */
void BKP_RTC_SetPrescalerCounter(uint32_t PrescalerCounterValue)
{
    /* Check the parameters. */
    assert_param(IS_BKP_RTC_PRESCALER_COUNTER_VALUE(PrescalerCounterValue));

    MDR_BKP->RTC_PREDIV_S = PrescalerCounterValue;
}

/**
 * @brief  Get the RTC_CLK prescaler counter value.
 * @param  None.
 * @return RTC_CLK prescaler counter value.
 */
uint32_t BKP_RTC_GetPrescalerCounter(void)
{
    return MDR_BKP->RTC_PREDIV_S;
}

/**
 * @brief  Set the value of the RTC_CLK prescaler.
 * @note   Frequency SEC_CLK = RTC_CLK / (PrescalerValue + 1).
 * @note   After writing, the internal register is updated after 2 clock cycles of the RTC_CLK frequency.
 * @param  PrescalerValue: a new value of the RTC_CLK prescaler.
 *         This parameter can be a number from 0x00000000 to 0x000FFFFF.
 * @return None.
 */
void BKP_RTC_SetPrescaler(uint32_t PrescalerValue)
{
    /* Check the parameters. */
    assert_param(IS_BKP_RTC_PRESCALER_VALUE(PrescalerValue));

    MDR_BKP->RTC_PRL = PrescalerValue;
}

/**
 * @brief  Get the value of the RTC_CLK prescaler.
 * @note   Frequency SEC_CLK = RTC_CLK / (PrescalerValue + 1).
 * @param  None.
 * @return RTC_CLK prescaler value.
 */
uint32_t BKP_RTC_GetPrescaler(void)
{
    return MDR_BKP->RTC_PRL;
}

/**
 * @brief  Set the date and time in BCD format.
 * @param  RTC_DateTime: The pointer to the @ref BKP_RTC_DateTime_TypeDef structure
 *         that is used for the date and time initialization.
 * @param  SetDate: @ref BitStatus - a date should be set.
 * @param  SetTime: @ref BitStatus - time should be set.
 * @return None.
 */
void BKP_RTC_SetDateTimeBCD(const BKP_RTC_DateTime_TypeDef* RTC_DateTime, BitStatus SetDate, BitStatus SetTime)
{
    uint32_t TmpReg1, TmpReg2;

    /* Check the parameters. */
    assert_param(IS_BIT_STATUS(SetDate));
    assert_param(IS_BIT_STATUS(SetTime));

    assert_param(SetDate ? IS_BKP_RTC_BCD_YEARS(RTC_DateTime->RTC_Year) : 1);
    assert_param(SetDate ? IS_BKP_RTC_BCD_MONTH(RTC_DateTime->RTC_Month) : 1);
    assert_param(SetDate ? IS_BKP_RTC_BCD_DAY(RTC_DateTime->RTC_Day) : 1);
    assert_param(SetDate ? IS_BKP_RTC_WEEKDAY(RTC_DateTime->RTC_WeekDay) : 1);

    assert_param(SetTime ? IS_BKP_RTC_TIME_FORMAT(RTC_DateTime->RTC_TimeFormat) : 1);
    assert_param(SetTime ? (((RTC_DateTime->RTC_TimeFormat) == BKP_RTC_FMT_12H) ? IS_BKP_RTC_BCD_PM_HOUR(RTC_DateTime->RTC_Hours) : IS_BKP_RTC_BCD_HOUR(RTC_DateTime->RTC_Hours)) : 1);
    assert_param(SetTime ? IS_BKP_RTC_BCD_MIN_SECS(RTC_DateTime->RTC_Minutes) : 1);
    assert_param(SetTime ? IS_BKP_RTC_BCD_MIN_SECS(RTC_DateTime->RTC_Seconds) : 1);

    if (SetDate || SetTime) {
        TmpReg1         = MDR_BKP->RTC_CR;
        MDR_BKP->RTC_CR = TmpReg1 & ~BKP_RTC_CR_RTC_EN;

        BKP_RTC_WaitForUpdate();
        if (SetDate == SET) {
            TmpReg2 = ((uint32_t)RTC_DateTime->RTC_Year << BKP_RTC_DR_YU_Pos) |
                      ((uint32_t)RTC_DateTime->RTC_Month << BKP_RTC_DR_MU_Pos) |
                      ((uint32_t)RTC_DateTime->RTC_Day << BKP_RTC_DR_DU_Pos) |
                      ((uint32_t)RTC_DateTime->RTC_WeekDay << BKP_RTC_DR_WDU_Pos);
            MDR_BKP->RTC_DR = TmpReg2;
            BKP_RTC_WaitForUpdate();
        }

