piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/src/MDR32VF0xI_bkp.c
        if (SetTime == SET) {
            TmpReg2 = ((uint32_t)RTC_DateTime->RTC_TimeFormat << BKP_RTC_TR_PM_Pos) |
                      ((uint32_t)RTC_DateTime->RTC_Hours << BKP_RTC_TR_HU_Pos) |
                      ((uint32_t)RTC_DateTime->RTC_Minutes << BKP_RTC_TR_MNU_Pos) |
                      ((uint32_t)RTC_DateTime->RTC_Seconds << BKP_RTC_TR_SU_Pos);
            MDR_BKP->RTC_TR = TmpReg2;
            BKP_RTC_WaitForUpdate();
        }

        MDR_BKP->RTC_CR = TmpReg1;
    }
}

/**
 * @brief  Get the date and time in BCD format.
 * @param  RTC_DateTime: The pointer to the @ref BKP_RTC_DateTime_TypeDef structure
 *         where the date should be stored.
 * @return None.
 */
void BKP_RTC_GetDateTimeBCD(BKP_RTC_DateTime_TypeDef* RTC_DateTime)
{
    uint32_t TempTR, TempDR;

    do {
        TempTR = MDR_BKP->RTC_TR;
        TempDR = MDR_BKP->RTC_DR;
    } while (TempTR != MDR_BKP->RTC_TR); /* Race condition. */

    BKP_RTC_GetDateTimeReg(TempDR, TempTR, RTC_DateTime);
}

/**
 * @brief  Set the date and time in BCD format for a specified alarm.
 * @param  RTC_Alarm: @ref BKP_RTC_Alarm_TypeDef - select the alarm to initialize.
 * @param  RTC_AlarmDateTime: The pointer to the @ref BKP_RTC_AlarmDateTime_TypeDef structure
 *         that is used for the date and time alarm initialization.
 * @return None.
 */
void BKP_RTC_SetAlarmBCD(BKP_RTC_Alarm_TypeDef RTC_Alarm, const BKP_RTC_AlarmDateTime_TypeDef* RTC_AlarmDateTime)
{
    uint32_t TmpReg;

    /* Check the parameters. */
    assert_param(IS_BKP_RTC_ALARM(RTC_Alarm));
    assert_param(IS_FUNCTIONAL_STATE(RTC_AlarmDateTime->RTC_IgnoreDate));
    assert_param(IS_FUNCTIONAL_STATE(RTC_AlarmDateTime->RTC_UseWeekDayInsteadDays));
    assert_param(IS_FUNCTIONAL_STATE(RTC_AlarmDateTime->RTC_IgnoreMinutes));
    assert_param(IS_FUNCTIONAL_STATE(RTC_AlarmDateTime->RTC_IgnoreSeconds));

    assert_param((RTC_AlarmDateTime->RTC_IgnoreDate) ? 1 : (RTC_AlarmDateTime->RTC_UseWeekDayInsteadDays ? IS_BKP_RTC_WEEKDAY(RTC_AlarmDateTime->RTC_WeekDay) : 1));
    assert_param((RTC_AlarmDateTime->RTC_IgnoreDate) ? 1 : (RTC_AlarmDateTime->RTC_UseWeekDayInsteadDays ? 1 : IS_BKP_RTC_BCD_DAY(RTC_AlarmDateTime->RTC_Day)));

    assert_param((RTC_AlarmDateTime->RTC_IgnoreHours) ? 1 : IS_BKP_RTC_TIME_FORMAT(RTC_AlarmDateTime->RTC_TimeFormat));
    assert_param((RTC_AlarmDateTime->RTC_IgnoreHours) ? 1 : (((RTC_AlarmDateTime->RTC_TimeFormat) == BKP_RTC_FMT_12H) ? IS_BKP_RTC_BCD_PM_HOUR(RTC_AlarmDateTime->RTC_Hours) : IS_BKP_RTC_BCD_HOUR(RTC_AlarmDateTime->RTC_Hours)));
    assert_param((RTC_AlarmDateTime->RTC_IgnoreMinutes) ? 1 : IS_BKP_RTC_BCD_MIN_SECS(RTC_AlarmDateTime->RTC_Minutes));
    assert_param((RTC_AlarmDateTime->RTC_IgnoreSeconds) ? 1 : IS_BKP_RTC_BCD_MIN_SECS(RTC_AlarmDateTime->RTC_Seconds));

    /* Form a new value. */
    TmpReg = ((uint32_t)(RTC_AlarmDateTime->RTC_Seconds) << BKP_RTC_ALARMxR_SU_Pos) |
             ((uint32_t)(RTC_AlarmDateTime->RTC_IgnoreSeconds) << BKP_RTC_ALARMxR_MSK1_Pos) |
             ((uint32_t)(RTC_AlarmDateTime->RTC_Minutes) << BKP_RTC_ALARMxR_MNU_Pos) |
             ((uint32_t)(RTC_AlarmDateTime->RTC_IgnoreMinutes) << BKP_RTC_ALARMxR_MSK2_Pos) |
             ((uint32_t)(RTC_AlarmDateTime->RTC_Hours) << BKP_RTC_ALARMxR_HU_Pos) |
             ((uint32_t)(RTC_AlarmDateTime->RTC_TimeFormat) << BKP_RTC_ALARMxR_PM_Pos) |
             ((uint32_t)(RTC_AlarmDateTime->RTC_IgnoreHours) << BKP_RTC_ALARMxR_MSK3_Pos) |
             ((uint32_t)(RTC_AlarmDateTime->RTC_UseWeekDayInsteadDays) << BKP_RTC_ALARMxR_WDSEL_Pos) |
             ((uint32_t)(RTC_AlarmDateTime->RTC_IgnoreDate) << BKP_RTC_ALARMxR_MSK4_Pos);

    if (RTC_AlarmDateTime->RTC_UseWeekDayInsteadDays != DISABLE) {
        TmpReg |= (uint32_t)(RTC_AlarmDateTime->RTC_WeekDay) << BKP_RTC_ALARMxR_DU_Pos;
    } else {
        TmpReg |= (uint32_t)(RTC_AlarmDateTime->RTC_Day) << BKP_RTC_ALARMxR_DU_Pos;
    }

    /* Write a value. */
    if (RTC_Alarm == BKP_RTC_ALARM_A) {
        MDR_BKP->RTC_ALRMAR = TmpReg;
    } else { /* (RTC_Alarm == BKP_RTC_ALARM_B) */
        MDR_BKP->RTC_ALRMBR = TmpReg;
    }
}

/**
 * @brief  Get the date and time in BCD format for a specified alarm.
 * @param  RTC_Alarm: @ref BKP_RTC_Alarm_TypeDef - select an alarm to read.
 * @param  RTC_AlarmDateTime: The pointer to the @ref BKP_RTC_AlarmDateTime_TypeDef structure
 *         where the date should be stored.
 * @return None.
 */
void BKP_RTC_GetAlarmBCD(BKP_RTC_Alarm_TypeDef RTC_Alarm, BKP_RTC_AlarmDateTime_TypeDef* RTC_AlarmDateTime)
{
    uint32_t TmpReg;

    /* Check the parameters. */
    assert_param(IS_BKP_RTC_ALARM(RTC_Alarm));

    /* Get a register value. */
    if (RTC_Alarm == BKP_RTC_ALARM_A) {
        TmpReg = MDR_BKP->RTC_ALRMAR;
    } else {
        TmpReg = MDR_BKP->RTC_ALRMBR;
    }

    RTC_AlarmDateTime->RTC_Seconds               = (uint8_t)((TmpReg & BKP_RTC_ALARM_SECONDS_MASK) >> BKP_RTC_ALARMxR_SU_Pos);
    RTC_AlarmDateTime->RTC_IgnoreSeconds         = (FunctionalState)((TmpReg & BKP_RTC_ALARMxR_MSK1) >> BKP_RTC_ALARMxR_MSK1_Pos);
    RTC_AlarmDateTime->RTC_Minutes               = (uint8_t)((TmpReg & BKP_RTC_ALARM_MINUTES_MASK) >> BKP_RTC_ALARMxR_MNU_Pos);
    RTC_AlarmDateTime->RTC_IgnoreMinutes         = (FunctionalState)((TmpReg & BKP_RTC_ALARMxR_MSK2) >> BKP_RTC_ALARMxR_MSK2_Pos);
    RTC_AlarmDateTime->RTC_Hours                 = (uint8_t)((TmpReg & BKP_RTC_ALARM_HOURS_MASK) >> BKP_RTC_ALARMxR_HU_Pos);
    RTC_AlarmDateTime->RTC_TimeFormat            = (BKP_RTC_FMT_TypeDef)((TmpReg & BKP_RTC_ALARMxR_PM) >> BKP_RTC_ALARMxR_PM_Pos);
    RTC_AlarmDateTime->RTC_IgnoreHours           = (FunctionalState)((TmpReg & BKP_RTC_ALARMxR_MSK3) >> BKP_RTC_ALARMxR_MSK3_Pos);
    RTC_AlarmDateTime->RTC_UseWeekDayInsteadDays = (FunctionalState)((TmpReg & BKP_RTC_ALARMxR_WDSEL) >> BKP_RTC_ALARMxR_WDSEL_Pos);
    RTC_AlarmDateTime->RTC_IgnoreDate            = (FunctionalState)((TmpReg & BKP_RTC_ALARMxR_MSK4) >> BKP_RTC_ALARMxR_MSK4_Pos);

    if (RTC_AlarmDateTime->RTC_UseWeekDayInsteadDays != DISABLE) {
        RTC_AlarmDateTime->RTC_WeekDay = (BKP_RTC_WeekDays_TypeDef)((TmpReg & BKP_RTC_ALARMxR_DU_Msk) >> BKP_RTC_ALARMxR_DU_Pos);
    } else {
        RTC_AlarmDateTime->RTC_Day = (uint8_t)((TmpReg & BKP_RTC_ALARM_DATE_MASK) >> BKP_RTC_ALARMxR_DU_Pos);
    }
}

