piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/src/MDR32VF0xI_bkp.c
/** @addtogroup BKP_RTC_WUT_Control_Functions BKP RTC WUT Control Functions
 * @{
 */

/**
 * @brief  Configure the RTC WUT clock source.
 * @note   RTC WUT works when RTC is enabled (RTC_EN = 1 in the BKP_RTC_CR register).
 * @param  ClockSource: @ref BKP_RTC_WUT_ClockSource_TypeDef - specify the RTC WUT clock source.
 * @return None.
 */
void BKP_RTC_WUT_SetClkSource(BKP_RTC_WUT_ClockSource_TypeDef ClockSource)
{
    uint32_t TmpReg;

    /* Check the parameters. */
    assert_param(IS_BKP_RTC_WUT_CLOCK_SOURCE(ClockSource));

    TmpReg = MDR_BKP->RTC_CR & ~BKP_RTC_CR_WUCK_SEL_Msk;
    TmpReg |= (uint32_t)ClockSource;
    MDR_BKP->RTC_CR = TmpReg;
}

/**
 * @brief  Get the RTC WUT clock source.
 * @param  None.
 * @return @ref BKP_RTC_WUT_ClockSource_TypeDef - the RTC WUT clock source.
 */
BKP_RTC_WUT_ClockSource_TypeDef BKP_RTC_WUT_GetClkSource(void)
{
    return (BKP_RTC_WUT_ClockSource_TypeDef)(MDR_BKP->RTC_CR & BKP_RTC_CR_WUCK_SEL_Msk);
}

/**
 * @brief  Set the RTC WUT counter value.
 * @note   Before calling this function, you must wait until the last write to the RTC registers is completed by calling BKP_RTC_WaitForUpdate().
 * @param  CounterValue: a new value of the RTC WUT counter.
 * @return None.
 */
void BKP_RTC_WUT_SetCounter(uint32_t CounterValue)
{
    MDR_BKP->RTC_WUTR = CounterValue;
}

/**
 * @brief  Get the RTC WUT counter value.
 * @param  None.
 * @return RTC WUT counter value.
 */
uint32_t BKP_RTC_WUT_GetCounter(void)
{
    return MDR_BKP->RTC_WUTR;
}

/**
 * @brief  Set the RTC WUT alarm value.
 * @note   After writing, the internal register is updated after 2 clock cycles of the RTC_CLK frequency.
 * @param  AlarmValue: a new value of the RTC WUT alarm.
 * @return None.
 */
void BKP_RTC_WUT_SetAlarm(uint32_t AlarmValue)
{
    MDR_BKP->RTC_ALRM = AlarmValue;
}

/**
 * @brief  Get the RTC WUT alarm value.
 * @param  None.
 * @return RTC WUT alarm value.
 */
uint32_t BKP_RTC_WUT_GetAlarm(void)
{
    return MDR_BKP->RTC_ALRM;
}

#if defined(USE_MDR32F02_REV_2) || defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
/**
 * @brief  Set the configuration behaviour the BKP SW output state (SW_PWR) on WUT alarm event.
 * @param  SWControl: @ref BKP_RTC_WUT_SWControl_TypeDef - the BKP SW output state configuration behaviour (SW_PWR) on WUT alarm event.
 * @return None.
 */
void BKP_RTC_WUT_SetSWControl(BKP_RTC_WUT_SWControl_TypeDef SWControl)
{
    uint32_t TmpReg;

    /* Check the parameters. */
    assert_param(IS_BKP_RTC_WUT_SW_CONTROL(SWControl));

    TmpReg = MDR_BKP->RTC_TAFCR & ~(BKP_RTC_TAFCR_FLAG_CLR_MASK | BKP_RTC_TAFCR_WAKE_SLEEP);
    TmpReg |= (uint32_t)SWControl;
    MDR_BKP->RTC_TAFCR = TmpReg;
}

/**
 * @brief  Get the configuration behaviour of the BKP SW output state (SW_PWR) on WUT alarm event.
 * @param  None.
 * @return @ref BKP_RTC_WUT_SWControl_TypeDef - the BKP SW output state configuration behaviour (SW_PWR) on WUT alarm event.
 */
BKP_RTC_WUT_SWControl_TypeDef BKP_RTC_WUT_GetSWControl(void)
{
    return (BKP_RTC_WUT_SWControl_TypeDef)(MDR_BKP->RTC_TAFCR & BKP_RTC_TAFCR_WAKE_SLEEP);
}
#endif

/** @} */ /* End of the group BKP_RTC_WUT_Control_Functions */

/** @addtogroup BKP_RTC_Event_Detection_Control_Functions BKP RTC Event Detection Control Functions
 * @{
 */

/**
 * @brief  Enable or disable the event detection on WAKEUPx inputs for the specified TAMPER.
 * @param  Tampers: TAMPER event detection.
 *         This parameter can be any combination of @ref BKP_RTC_TAMPER_TypeDef values.
 * @param  NewState: @ref FunctionalState - a new state of the TAMPER event detection.
 * @return None.
 */
void BKP_RTC_TAMPER_Cmd(uint32_t Tampers, FunctionalState NewState)
{
    /* Check the parameters. */
    assert_param(IS_BKP_RTC_TAMPERS(Tampers));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

#if defined(USE_MDR32F02_REV_1X)
    if (NewState != DISABLE) {
        MDR_BKP->RTC_TAFCR |= Tampers;
    } else {
        MDR_BKP->RTC_TAFCR &= ~Tampers;
    }
#else
    if (NewState != DISABLE) {
        MDR_BKP->RTC_TAFCR = (MDR_BKP->RTC_TAFCR & ~(BKP_RTC_TAFCR_FLAG_CLR_MASK | BKP_RTC_TAFCR_TAMP_EN)) | Tampers;
    } else {
        MDR_BKP->RTC_TAFCR = (MDR_BKP->RTC_TAFCR & ~(BKP_RTC_TAFCR_FLAG_CLR_MASK | BKP_RTC_TAFCR_TAMP_EN)) & ~Tampers;
    }
#endif
}

/**
 * @brief  Get the work state of the event detection on WAKEUPx inputs for the specified TAMPER.
 * @param  Tampers: @ref BKP_RTC_TAMPER_TypeDef - TAMPER event detection.
 * @return @ref FunctionalState - the current work state of the TAMPER event detection.
 */
FunctionalState BKP_RTC_TAMPER_GetCmdState(BKP_RTC_TAMPER_TypeDef Tampers)
{
    FunctionalState State;

    /* Check the parameters. */
    assert_param(IS_BKP_RTC_TAMPER(Tampers));

    if ((MDR_BKP->RTC_TAFCR & (uint32_t)Tampers) == (uint32_t)Tampers) {
        State = ENABLE;
    } else {
        State = DISABLE;
    }

    return State;
}

/**
 * @brief  Set the capture event for the specified TAMPER WAKEUPx input.
 * @param  Wakeups: Specify the TAMPER WAKEUPx inputs for which the capture event will be set.
 *         This parameter can be any combination of @ref BKP_RTC_TAMPER_Wakeup_TypeDef values.
 * @param  Event: @ref BKP_RTC_TAMPER_Event_TypeDef - capture event on specified WAKEUPx inputs.
 * @return None.
 */
void BKP_RTC_TAMPER_SetEvent(uint32_t Wakeups, BKP_RTC_TAMPER_Event_TypeDef Event)
{
    uint32_t Pos;
    uint32_t Mask;
    uint32_t TmpReg;

    /* Check the parameters. */
    assert_param(IS_BKP_RTC_TAMPER_WAKEUPS(Wakeups));
    assert_param(IS_BKP_RTC_TAMPER_EVENT(Event));

    Pos = 0;
#if defined(USE_MDR32F02_REV_1X)
    Mask   = BKP_RTC_TAFCR_TAMP_TRG1;
    TmpReg = MDR_BKP->RTC_TAFCR;
#else
    Mask   = BKP_RTC_TAFCR_TAMP_TRG1 | BKP_RTC_TAFCR_TAMP_EDGE_W1 | BKP_RTC_TAFCR_TAMP_LEVEL_W1;
    TmpReg = MDR_BKP->RTC_TAFCR & ~BKP_RTC_TAFCR_FLAG_CLR_MASK;
#endif
    for (; Wakeups && Pos < 3; Wakeups >>= 1, Pos++) {
        if ((Wakeups & 0x1) != 0) {
            TmpReg = (TmpReg & ~(Mask << Pos)) | ((uint32_t)Event << Pos);
        }
    }
    MDR_BKP->RTC_TAFCR = TmpReg;
}

/**
 * @brief  Enable or disable the TIMESTAMP event detection on WAKEUP3-WAKEUP1 inputs.
 * @note   TIMESTAMP works when RTC is enabled (RTC_EN = 1 in the BKP_RTC_CR register).
 * @param  NewState: @ref FunctionalState - a new state of the TIMESTAMP event detection.
 * @return None.
 */
void BKP_RTC_TIMESTAMP_Cmd(FunctionalState NewState)
{
    uint32_t TmpReg;

    /* Check the parameters. */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

