piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/src/MDR32VF0xI_bkp.c
#if defined(USE_MDR32F02_REV_1X)
    TmpReg = MDR_BKP->RTC_TAFCR & ~BKP_RTC_TAFCR_TS_EN;
#else
    TmpReg = MDR_BKP->RTC_TAFCR & ~(BKP_RTC_TAFCR_FLAG_CLR_MASK | BKP_RTC_TAFCR_TS_EN);
#endif
    if (NewState != DISABLE) {
        TmpReg |= BKP_RTC_TAFCR_TS_EN;
    }
    MDR_BKP->RTC_TAFCR = TmpReg;
}

/**
 * @brief  Get the work state of the TIMESTAMP event detection on WAKEUP3-WAKEUP1 inputs.
 * @param  None.
 * @return @ref FunctionalState - the current work state of the TIMESTAMP event detection.
 */
FunctionalState BKP_RTC_TIMESTAMP_GetCmdState(void)
{
    FunctionalState State;

    if ((MDR_BKP->RTC_TAFCR & BKP_RTC_TAFCR_TS_EN) == 0) {
        State = DISABLE;
    } else {
        State = ENABLE;
    }

    return State;
}

/**
 * @brief  Set the capture event for the specified TIMESTAMP WAKEUPx input.
 * @param  Wakeups: Specify the TIMESTAMP WAKEUPx inputs for which the capture event will be set.
 *         This parameter can be any combination of @ref BKP_RTC_TIMESTAMP_Wakeup_TypeDef values.
 * @param  Event: @ref BKP_RTC_TIMESTAMP_Event_TypeDef - capture event on specified WAKEUPx inputs.
 * @return None.
 */
void BKP_RTC_TIMESTAMP_SetEvent(uint32_t Wakeups, BKP_RTC_TIMESTAMP_Event_TypeDef Event)
{
    uint32_t Pos;
    uint32_t Mask;
    uint32_t TmpReg;

    /* Check the parameters. */
    assert_param(IS_BKP_RTC_TIMESTAMP_WAKEUPS(Wakeups));
    assert_param(IS_BKP_RTC_TIMESTAMP_EVENT(Event));

    Pos  = 0;
    Mask = BKP_RTC_TAFCR_TS_EDGE1;
#if defined(USE_MDR32F02_REV_1X)
    TmpReg = MDR_BKP->RTC_TAFCR;
#else
    TmpReg = MDR_BKP->RTC_TAFCR & ~BKP_RTC_TAFCR_FLAG_CLR_MASK;
#endif
    for (; Wakeups && Pos < 3; Wakeups >>= 1, Pos++) {
        if ((Wakeups & 0x1) != 0) {
            TmpReg = (TmpReg & ~(Mask << Pos)) | ((uint32_t)Event << Pos);
        }
    }
    MDR_BKP->RTC_TAFCR = TmpReg;
}

/**
 * @brief  Get the date and time timestamp in BCD format for a specified TIMESTAMP WAKEUPx input.
 * @param  Wakeup: @ref BKP_RTC_TIMESTAMP_Wakeup_TypeDef - TIMESTAMP WAKEUPx input.
 * @param  RTC_DateTime: The pointer to the @ref BKP_RTC_DateTime_TypeDef structure
 *         where the date must be stored.
 * @return None.
 */
void BKP_RTC_TIMESTAMP_GetDateTimeBCD(BKP_RTC_TIMESTAMP_Wakeup_TypeDef Wakeup, BKP_RTC_DateTime_TypeDef* RTC_DateTime)
{
    /* Check the parameters. */
    assert_param(IS_BKP_RTC_TIMESTAMP_WAKEUP(Wakeup));

    uint32_t      TempTR;
    uint32_t      TempDR;
    __I uint32_t* PtrTR;
    __I uint32_t* PtrDR;

    PtrTR = &MDR_BKP->RTC_TSTR1 + ((uint32_t)Wakeup >> 1);
    PtrDR = &MDR_BKP->RTC_TSDR1 + ((uint32_t)Wakeup >> 1);

    do {
        TempTR = *PtrTR;
        TempDR = *PtrDR;
    } while (TempTR != *PtrTR); /* Race condition. */

    BKP_RTC_GetDateTimeReg(TempDR, TempTR, RTC_DateTime);
}

/** @} */ /* End of the group BKP_RTC_Event_Detection_Control_Functions */

#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
/** @addtogroup BKP_RTC_TMPCAL_Control_Functions BKP RTC TMPCAL Control Functions
 * @{
 */

/**
 * @brief  Enable or disable the RTC temperature sensor for temperature compensation of the LSE clock.
 *         Temperature frequency compensation is performed by hardware decreasing the RTC_CLK prescaler (BKP_RTC_PRL)
 *         by the calibration constant specified for each RTC temperature sensor result (code 0 to 15).
 * @note   RTC TMPCAL works when RTC is enabled (RTC_EN = 1 in the BKP_RTC_CR register).
 * @param  NewState: @ref FunctionalState - a new state of the RTC temperature sensor.
 * @return None.
 */
void BKP_RTC_TMPCAL_Cmd(FunctionalState NewState)
{
    /* Check the parameters. */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState != DISABLE) {
        MDR_BKP->RTC_TMPCAL3 |= BKP_RTC_TMPCAL3_TEMP_EN;
    } else {
        MDR_BKP->RTC_TMPCAL3 &= ~BKP_RTC_TMPCAL3_TEMP_EN;
    }
}

/**
 * @brief  Get the RTC temperature sensor work state.
 * @param  None.
 * @return @ref FunctionalState - the current work state of the RTC temperature sensor.
 */
FunctionalState BKP_RTC_TMPCAL_GetCmdState(void)
{
    FunctionalState State;

    if ((MDR_BKP->RTC_TMPCAL3 & BKP_RTC_TMPCAL3_TEMP_EN) == 0) {
        State = DISABLE;
    } else {
        State = ENABLE;
    }

    return State;
}

/**
 * @brief  Set the calibration constants for temperature compensation of the LSE clock.
 * @param  TMPCAL_Calibration: The pointer to the @ref BKP_RTC_TMPCAL_Calibration_TypeDef structure
 *         that contains the calibration constants.
 * @return None.
 */
void BKP_RTC_TMPCAL_SetCalibration(const BKP_RTC_TMPCAL_Calibration_TypeDef* TMPCAL_Calibration)
{
    uint32_t TmpReg;

#if (USE_ASSERT_INFO != 0)
    uint32_t Index;
    /* Check the parameters. */
    for (Index = 0; Index < 16; Index++) {
        assert_param(IS_BKP_RTC_TMPCAL_CALIBRATION(TMPCAL_Calibration->Const[Index]));
    }
#endif

    MDR_BKP->RTC_TMPCAL1 = ((uint32_t)TMPCAL_Calibration->Const[0] << BKP_RTC_TMPCAL1_CONST0_Pos) |
                           ((uint32_t)TMPCAL_Calibration->Const[1] << BKP_RTC_TMPCAL1_CONST1_Pos) |
                           ((uint32_t)TMPCAL_Calibration->Const[2] << BKP_RTC_TMPCAL1_CONST2_Pos) |
                           ((uint32_t)TMPCAL_Calibration->Const[3] << BKP_RTC_TMPCAL1_CONST3_Pos) |
                           ((uint32_t)TMPCAL_Calibration->Const[4] << BKP_RTC_TMPCAL1_CONST4_Pos) |
                           ((uint32_t)TMPCAL_Calibration->Const[5] << BKP_RTC_TMPCAL1_CONST5_Pos) |
                           ((uint32_t)TMPCAL_Calibration->Const[6] << BKP_RTC_TMPCAL1_CONST6_LOW_Pos);

    MDR_BKP->RTC_TMPCAL2 = (((uint32_t)TMPCAL_Calibration->Const[6] >> 2) << BKP_RTC_TMPCAL2_CONST6_HIGH_Pos) |
                           ((uint32_t)TMPCAL_Calibration->Const[7] << BKP_RTC_TMPCAL2_CONST7_Pos) |
                           ((uint32_t)TMPCAL_Calibration->Const[8] << BKP_RTC_TMPCAL2_CONST8_Pos) |
                           ((uint32_t)TMPCAL_Calibration->Const[9] << BKP_RTC_TMPCAL2_CONST9_Pos) |
                           ((uint32_t)TMPCAL_Calibration->Const[10] << BKP_RTC_TMPCAL2_CONST10_Pos) |
                           ((uint32_t)TMPCAL_Calibration->Const[11] << BKP_RTC_TMPCAL2_CONST11_Pos) |
                           ((uint32_t)TMPCAL_Calibration->Const[12] << BKP_RTC_TMPCAL2_CONST12_LOW_Pos);

    TmpReg = MDR_BKP->RTC_TMPCAL3 & ~(BKP_RTC_TMPCAL3_CONST12_HIGH | BKP_RTC_TMPCAL3_CONST13_Msk | BKP_RTC_TMPCAL3_CONST14_Msk | BKP_RTC_TMPCAL3_CONST15_Msk);
    TmpReg |= (((uint32_t)TMPCAL_Calibration->Const[12] >> 4) << BKP_RTC_TMPCAL3_CONST12_HIGH_Pos) |
              ((uint32_t)TMPCAL_Calibration->Const[13] << BKP_RTC_TMPCAL3_CONST13_Pos) |
              ((uint32_t)TMPCAL_Calibration->Const[14] << BKP_RTC_TMPCAL3_CONST14_Pos) |
              ((uint32_t)TMPCAL_Calibration->Const[15] << BKP_RTC_TMPCAL3_CONST15_Pos);
    MDR_BKP->RTC_TMPCAL3 = TmpReg;
}

/**
 * @brief  Get the calibration constants for temperature compensation of the LSE clock.
 * @param  TMPCAL_Calibration: The pointer to the @ref BKP_RTC_TMPCAL_Calibration_TypeDef structure
 *         where the calibration constants should be stored.
 * @return None.
 */
void BKP_RTC_TMPCAL_GetCalibration(BKP_RTC_TMPCAL_Calibration_TypeDef* TMPCAL_Calibration)
{
    uint32_t TmpReg;

    TmpReg                       = MDR_BKP->RTC_TMPCAL1;
    TMPCAL_Calibration->Const[0] = (uint8_t)((TmpReg & BKP_RTC_TMPCAL1_CONST0_Msk) >> BKP_RTC_TMPCAL1_CONST0_Pos);
    TMPCAL_Calibration->Const[1] = (uint8_t)((TmpReg & BKP_RTC_TMPCAL1_CONST1_Msk) >> BKP_RTC_TMPCAL1_CONST1_Pos);
    TMPCAL_Calibration->Const[2] = (uint8_t)((TmpReg & BKP_RTC_TMPCAL1_CONST2_Msk) >> BKP_RTC_TMPCAL1_CONST2_Pos);
    TMPCAL_Calibration->Const[3] = (uint8_t)((TmpReg & BKP_RTC_TMPCAL1_CONST3_Msk) >> BKP_RTC_TMPCAL1_CONST3_Pos);
    TMPCAL_Calibration->Const[4] = (uint8_t)((TmpReg & BKP_RTC_TMPCAL1_CONST4_Msk) >> BKP_RTC_TMPCAL1_CONST4_Pos);
    TMPCAL_Calibration->Const[5] = (uint8_t)((TmpReg & BKP_RTC_TMPCAL1_CONST5_Msk) >> BKP_RTC_TMPCAL1_CONST5_Pos);
    TMPCAL_Calibration->Const[6] = (uint8_t)((TmpReg & BKP_RTC_TMPCAL1_CONST6_LOW_Msk) >> BKP_RTC_TMPCAL1_CONST6_LOW_Pos);

    TmpReg = MDR_BKP->RTC_TMPCAL2;
    TMPCAL_Calibration->Const[6] |= (uint8_t)(((TmpReg & BKP_RTC_TMPCAL2_CONST6_HIGH_Msk) >> BKP_RTC_TMPCAL2_CONST6_HIGH_Pos) << 2);
    TMPCAL_Calibration->Const[7]  = (uint8_t)((TmpReg & BKP_RTC_TMPCAL2_CONST7_Msk) >> BKP_RTC_TMPCAL2_CONST7_Pos);
    TMPCAL_Calibration->Const[8]  = (uint8_t)((TmpReg & BKP_RTC_TMPCAL2_CONST8_Msk) >> BKP_RTC_TMPCAL2_CONST8_Pos);
    TMPCAL_Calibration->Const[9]  = (uint8_t)((TmpReg & BKP_RTC_TMPCAL2_CONST9_Msk) >> BKP_RTC_TMPCAL2_CONST9_Pos);
    TMPCAL_Calibration->Const[10] = (uint8_t)((TmpReg & BKP_RTC_TMPCAL2_CONST10_Msk) >> BKP_RTC_TMPCAL2_CONST10_Pos);
    TMPCAL_Calibration->Const[11] = (uint8_t)((TmpReg & BKP_RTC_TMPCAL2_CONST11_Msk) >> BKP_RTC_TMPCAL2_CONST11_Pos);
    TMPCAL_Calibration->Const[12] = (uint8_t)((TmpReg & BKP_RTC_TMPCAL2_CONST12_LOW_Msk) >> BKP_RTC_TMPCAL2_CONST12_LOW_Pos);

    TmpReg = MDR_BKP->RTC_TMPCAL3;
    TMPCAL_Calibration->Const[12] |= (uint8_t)(((TmpReg & BKP_RTC_TMPCAL3_CONST12_HIGH_Msk) >> BKP_RTC_TMPCAL3_CONST12_HIGH_Pos) << 4);
    TMPCAL_Calibration->Const[13] = (uint8_t)((TmpReg & BKP_RTC_TMPCAL3_CONST13_Msk) >> BKP_RTC_TMPCAL3_CONST13_Pos);
    TMPCAL_Calibration->Const[14] = (uint8_t)((TmpReg & BKP_RTC_TMPCAL3_CONST14_Msk) >> BKP_RTC_TMPCAL3_CONST14_Pos);
    TMPCAL_Calibration->Const[15] = (uint8_t)((TmpReg & BKP_RTC_TMPCAL3_CONST15_Msk) >> BKP_RTC_TMPCAL3_CONST15_Pos);
}

/**
 * @brief  Return the RTC temperature sensor result.
 * @param  None.
 * @return RTC temperature sensor result.
 */
uint8_t BKP_RTC_TMPCAL_GetResult(void)
{
    return (uint8_t)((MDR_BKP->RTC_TMPCAL3 & BKP_RTC_TMPCAL3_TEMP_RESULT_Msk) >> BKP_RTC_TMPCAL3_TEMP_RESULT_Pos);
}

/** @} */ /* End of the group BKP_RTC_TMPCAL_Control_Functions */
#endif

/**
 * @brief  Convert the date and time from BCD to BIN format.
 * @param  RTC_DateTime: @ref BKP_RTC_DateTime_TypeDef - the pointer to the date/time structure to be converted.
 * @return None.
 */
void BKP_RTC_ConvertToBINFormat(BKP_RTC_DateTime_TypeDef* RTC_DateTime)
{
    RTC_DateTime->RTC_Year    = CONVERT_BCD_TO_BIN(RTC_DateTime->RTC_Year);
    RTC_DateTime->RTC_Month   = CONVERT_BCD_TO_BIN(RTC_DateTime->RTC_Month);
    RTC_DateTime->RTC_Day     = CONVERT_BCD_TO_BIN(RTC_DateTime->RTC_Day);
    RTC_DateTime->RTC_Hours   = CONVERT_BCD_TO_BIN(RTC_DateTime->RTC_Hours);
    RTC_DateTime->RTC_Minutes = CONVERT_BCD_TO_BIN(RTC_DateTime->RTC_Minutes);
    RTC_DateTime->RTC_Seconds = CONVERT_BCD_TO_BIN(RTC_DateTime->RTC_Seconds);
}

/**
 * @brief Convert the date and time from BIN to BCD format.
 * @param RTC_DateTime: @ref BKP_RTC_DateTime_TypeDef - the pointer to the date/time structure to be converted.
 * @return None.
 */
void BKP_RTC_ConvertToBCDFormat(BKP_RTC_DateTime_TypeDef* RTC_DateTime)
{
    RTC_DateTime->RTC_Year    = CONVERT_BIN_TO_BCD(RTC_DateTime->RTC_Year);
    RTC_DateTime->RTC_Month   = CONVERT_BIN_TO_BCD(RTC_DateTime->RTC_Month);
    RTC_DateTime->RTC_Day     = CONVERT_BIN_TO_BCD(RTC_DateTime->RTC_Day);
    RTC_DateTime->RTC_Hours   = CONVERT_BIN_TO_BCD(RTC_DateTime->RTC_Hours);
    RTC_DateTime->RTC_Minutes = CONVERT_BIN_TO_BCD(RTC_DateTime->RTC_Minutes);
    RTC_DateTime->RTC_Seconds = CONVERT_BIN_TO_BCD(RTC_DateTime->RTC_Seconds);
}

/**
 * @brief  Clear the RTC status flags.
 * @note   In MDR32F02 rev 1.x: Clearing the BKP_RTC_FLAG_TAMPER bit uses the cycle counter and core clock from SystemCoreClock for the delay.
 *         Do not disable the cycle counter. Before calling BKP_RTC_ClearFlags(BKP_RTC_FLAG_TAMPER), you must update SystemCoreClock by calling SystemCoreClockUpdate().
 * @param  Flags: @ref BKP_RTC_Flags_TypeDef - specify the RTC flags to clear.
 *         This parameter can be any combination of the following values:
 *             @arg BKP_RTC_FLAG_SECF:         RTC second flag.
 *             @arg BKP_RTC_FLAG_ALARM_A:      RTC alarm A event flag.
 *             @arg BKP_RTC_FLAG_ALARM_B:      RTC alarm B event flag.
 *             @arg BKP_RTC_FLAG_WUTF:         WUT alarm.
 *             @arg BKP_RTC_FLAG_OWF:          WUT overflow flag.
 *             @arg BKP_RTC_FLAG_TAMPER:       TAMPER event flag (WAKEUP3-WAKEUP1).
 *             @arg BKP_RTC_FLAG_TAMPER_W1:    TAMPER WAKEUP1 event flag (not implemented in MDR32F02 rev.1.0 and rev.1.1).
 *             @arg BKP_RTC_FLAG_TAMPER_W2:    TAMPER WAKEUP2 event flag (not implemented in MDR32F02 rev.1.0 and rev.1.1).
 *             @arg BKP_RTC_FLAG_TAMPER_W3:    TAMPER WAKEUP3 event flag (not implemented in MDR32F02 rev.1.0 and rev.1.1).
 *             @arg BKP_RTC_FLAG_TIMESTAMP:    TIMESTAMP event flag (WAKEUP3-WAKEUP1).
 *             @arg BKP_RTC_FLAG_TIMESTAMP_W1: TIMESTAMP WAKEUP1 event flag (not implemented in MDR32F02 rev.1.0 and rev.1.1).
 *             @arg BKP_RTC_FLAG_TIMESTAMP_W2: TIMESTAMP WAKEUP2 event flag (not implemented in MDR32F02 rev.1.0 and rev.1.1).
 *             @arg BKP_RTC_FLAG_TIMESTAMP_W3: TIMESTAMP WAKEUP3 event flag (not implemented in MDR32F02 rev.1.0 and rev.1.1).
 * @return None.
 */
void BKP_RTC_ClearFlags(uint32_t Flags)
{
#if defined(USE_MDR32F02_REV_1X)
    uint32_t DelayConst;
#endif
    uint32_t TmpReg;

    /* Check the parameters. */
    assert_param(IS_BKP_RTC_FLAGS_CLR(Flags));

    TmpReg = Flags & BKP_RTC_CS_FLAG_CLR_MASK;
    if (TmpReg != 0) {
        MDR_BKP->RTC_CS = (MDR_BKP->RTC_CS & ~BKP_RTC_CS_FLAG_CLR_MASK) | TmpReg;
    }

