piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/src/MDR32VF0xI_bkp.c
#if defined(USE_MDR32F02_REV_1X)
    if ((Flags & BKP_LDO_TAMPF) != 0) {
        DelayConst = DELAY_CYCLE_COUNTER_GET_CONST_US(SystemCoreClock);

        MDR_BKP->RTC_TAFCR &= ~BKP_RTC_TAFCR_TAMP_EN;
        DELAY_CycleCounter_WaitTicksAsm(DELAY_GET_TICKS_US(100, DelayConst)); /* Wait for 100 us. */

        MDR_BKP->LDO = (MDR_BKP->LDO & ~BKP_LDO_SW_OFF) | BKP_LDO_TAMPF;
        DELAY_CycleCounter_WaitTicksAsm(DELAY_GET_TICKS_US(100, DelayConst)); /* Wait for 100 us. */
    }
#else
    TmpReg = Flags & BKP_RTC_TAFCR_FLAG_CLR_MASK;
    if (TmpReg != 0) {
        MDR_BKP->RTC_TAFCR = (MDR_BKP->RTC_TAFCR & ~BKP_RTC_TAFCR_FLAG_CLR_MASK) | TmpReg;
    }

    if ((Flags & BKP_LDO_TAMPF) != 0) {
        MDR_BKP->LDO = (MDR_BKP->LDO & ~BKP_LDO_SW_OFF) | BKP_LDO_TAMPF;
    }
#endif
}

/**
 * @brief  Check whether a specified RTC status flag is set or not.
 * @param  Flag: @ref BKP_RTC_Flags_TypeDef - specify a flag to check.
 * @return @ref FlagStatus - the current RTC status flag state (SET or RESET).
 */
FlagStatus BKP_RTC_GetFlagStatus(BKP_RTC_Flags_TypeDef Flag)
{
    FlagStatus Status;
    uint32_t   TmpReg;

    /* Check the parameters. */
    assert_param(IS_BKP_RTC_FLAG(Flag));

    if (((uint32_t)Flag & BKP_RTC_CS_FLAG_MASK) != 0) {
        TmpReg = MDR_BKP->RTC_CS;
    } else if (((uint32_t)Flag & BKP_RTC_TAFCR_FLAG_MASK) != 0) {
        TmpReg = MDR_BKP->RTC_TAFCR;
#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
    } else if (((uint32_t)Flag & BKP_RTC_TMPCAL3_TEMP_RESULT_RDY) != 0) {
        TmpReg = MDR_BKP->RTC_TMPCAL3;
#endif
    } else {
        TmpReg = MDR_BKP->LDO;
    }

    if ((TmpReg & (uint32_t)Flag) != 0) {
        Status = SET;
    } else {
        Status = RESET;
    }

    return Status;
}

/**
 * @brief  Return a combined value of the RTC status flags.
 * @param  None.
 * @return A combined value of status flags.
 */
uint32_t BKP_RTC_GetStatus(void)
{
    uint32_t Flags;

    Flags = (MDR_BKP->RTC_CS & BKP_RTC_CS_FLAG_MASK) |
            (MDR_BKP->RTC_TAFCR & BKP_RTC_TAFCR_FLAG_MASK) |
#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
            (MDR_BKP->RTC_TMPCAL3 & BKP_RTC_TMPCAL3_TEMP_RESULT_RDY) |
#endif
            (MDR_BKP->LDO & BKP_LDO_TAMPF);

    return Flags;
}

/**
 * @brief  Enable or disable BKP RTC interrupts.
 * @param  ITs: Specify the BKP interrupt sources to be enabled or disabled.
 *         This parameter can be any combination of @ref BKP_RTC_IT_TypeDef values.
 * @param  NewState: @ref FunctionalState - a new state of BKP RTC interrupts.
 * @return None.
 */
void BKP_RTC_ITConfig(uint32_t ITs, FunctionalState NewState)
{
    uint32_t TmpIT;

    /* Check the parameters. */
    assert_param(IS_BKP_RTC_CONFIG_ITS(ITs));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    /* Setup a new interrupts state, the RTC_CS register. */
    TmpIT = ITs & BKP_RTC_CS_IT_MASK;
    if (TmpIT != 0) {
        if (NewState != DISABLE) {
            MDR_BKP->RTC_CS = (MDR_BKP->RTC_CS & ~BKP_RTC_CS_FLAG_CLR_MASK) | TmpIT;
        } else {
            MDR_BKP->RTC_CS = (MDR_BKP->RTC_CS & ~BKP_RTC_CS_FLAG_CLR_MASK) & ~TmpIT;
        }
    }
    /* Setup a new interrupts state, the RTC_TAFCR register. */
    TmpIT = (ITs >> 16) & BKP_RTC_TAFCR_IT_MASK;
    if (TmpIT != 0) {
#if defined(USE_MDR32F02_REV_1X)
        if (NewState != DISABLE) {
            MDR_BKP->RTC_TAFCR |= TmpIT;
        } else {
            MDR_BKP->RTC_TAFCR &= ~TmpIT;
        }
#else
        if (NewState != DISABLE) {
            MDR_BKP->RTC_TAFCR = (MDR_BKP->RTC_TAFCR & ~BKP_RTC_TAFCR_FLAG_CLR_MASK) | TmpIT;
        } else {
            MDR_BKP->RTC_TAFCR = (MDR_BKP->RTC_TAFCR & ~BKP_RTC_TAFCR_FLAG_CLR_MASK) & ~TmpIT;
        }
#endif
    }
}

/**
 * @brief  Get the date and time from the specified registers.
 * @param  DateRegVal: Date register value.
 * @param  TimeRegVal: Time register value.
 * @param  RTC_DateTime: The pointer to the @ref BKP_RTC_DateTime_TypeDef where the date and time must be stored.
 * @return None.
 */
static void BKP_RTC_GetDateTimeReg(uint32_t DateRegVal, uint32_t TimeRegVal, BKP_RTC_DateTime_TypeDef* RTC_DateTime)
{
    RTC_DateTime->RTC_Year    = (uint8_t)((DateRegVal & BKP_RTC_DR_YEAR_MASK) >> BKP_RTC_DR_YU_Pos);
    RTC_DateTime->RTC_Month   = (uint8_t)((DateRegVal & BKP_RTC_DR_MONTH_MASK) >> BKP_RTC_DR_MU_Pos);
    RTC_DateTime->RTC_Day     = (uint8_t)((DateRegVal & BKP_RTC_DR_DATE_MASK) >> BKP_RTC_DR_DU_Pos);
    RTC_DateTime->RTC_WeekDay = (BKP_RTC_WeekDays_TypeDef)((DateRegVal & BKP_RTC_DR_WDU_Msk) >> BKP_RTC_DR_WDU_Pos);

    RTC_DateTime->RTC_TimeFormat = (BKP_RTC_FMT_TypeDef)((TimeRegVal & BKP_RTC_TR_PM) >> BKP_RTC_TR_PM_Pos);
    RTC_DateTime->RTC_Hours      = (uint8_t)((TimeRegVal & BKP_RTC_TR_HOURS_MASK) >> BKP_RTC_TR_HU_Pos);
    RTC_DateTime->RTC_Minutes    = (uint8_t)((TimeRegVal & BKP_RTC_TR_MINUTES_MASK) >> BKP_RTC_TR_MNU_Pos);
    RTC_DateTime->RTC_Seconds    = (uint8_t)((TimeRegVal & BKP_RTC_TR_SECONDS_MASK) >> BKP_RTC_TR_SU_Pos);
}

/** @} */ /* End of the group BKP_RTC_Control_Functions */

/** @} */ /* End of the group BKP_Exported_Functions */

/** @} */ /* End of the group BKP */

/** @} */ /* End of the group MDR32VF0xI_StdPeriph_Driver */

/*********************** (C) COPYRIGHT 2025 Milandr ****************************
 *
 * END OF FILE MDR32VF0xI_bkp.c */

